In [24]:

import sqlite3

import pandas as pd
import numpy as np
import datetime as dt
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.ticker as mticker
import matplotlib.dates as mdates
import matplotlib.colors as mcolors
from matplotlib import style

import matplotlib.pyplot as plt
import seaborn as sns

Database connection using sqlite 3

In [25]:
db_path = 'stockprice.db'
con = sqlite3.connect(db_path)

Test db connection with a simple sql statement

In [26]:
sql_base_select = 'SELECT {} FROM {};'

# format sql string
sql = sql_base_select.format('*', 'A_data')

# run select statement and show results
df= pd.read_sql(sql, con)

df.head()

   index        date   open   high    low  close   volume Name
0      0  2013-02-08  45.07  45.35  45.00  45.08  1824755    A
1      1  2013-02-11  45.17  45.18  44.45  44.60  2915405    A
2      2  2013-02-12  44.81  44.95  44.50  44.62  2373731    A
3      3  2013-02-13  44.81  45.24  44.68  44.75  2052338    A
4      4  2013-02-14  44.72  44.78  44.36  44.58  3826245    A

Collecting Various Stock Data

Here we are using APPLE (ticker = AAPL) as an example.

In [27]:
start = dt.datetime(2013,2,8)
end = dt.datetime(2018,2,7)

df.tail(5)

      index        date   open    high     low  close   volume Name
1254   1254  2018-02-01  73.18  73.780  72.510  72.83  2008177    A
1255   1255  2018-02-02  72.32  72.760  71.220  71.25  1955697    A
1256   1256  2018-02-05  70.86  71.480  68.180  68.22  2860726    A
1257   1257  2018-02-06  66.96  68.830  66.130  68.45  4121239    A
1258   1258  2018-02-07  68.19  69.085  67.905  68.06  1988391    A

In [28]:
company_list =['AAPL_data','AMZN_data','GOOG_data','MSFT_data']

all_data = pd.DataFrame()
a=0
asql = ''
for tableToMerge in company_list:
    if a != len(company_list)-1:
        asql = asql + 'SELECT * FROM '+tableToMerge+' UNION '
    else:
        asql = asql + 'SELECT * FROM '+tableToMerge+' ORDER BY Name;'
    # format sql string
    a = a+1
# run select statement and show results
all_data = pd.read_sql(asql, con)
all_data.head(6)

   index        date     open     high      low    close     volume  Name
0      0  2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
1      1  2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2      2  2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
3      3  2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
4      4  2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL
5      5  2013-02-15  66.9785  67.1656  65.7028  65.7371   97924631  AAPL

In [29]:
all_data.shape

(4752, 8)

In [30]:
all_data['Name'].unique()

array(['AAPL', 'AMZN', 'GOOG', 'MSFT'], dtype=object)

## Analysing change in Price in Stock overtime

In [32]:
# checking missing values
all_data.isnull().sum()

index     0
date      0
open      0
high      0
low       0
close     0
volume    0
Name      0
dtype: int64

In [33]:
#checking data types
all_data.dtypes

index       int64
date       object
open      float64
high      float64
low       float64
close     float64
volume      int64
Name       object
dtype: object

In [35]:
## converting data-type of "date" featuer into date-time ..
all_data['date'] =pd.to_datetime(all_data['date'])

In [36]:
all_data['date']

0      2013-02-08
1      2013-02-11
2      2013-02-12
3      2013-02-13
4      2013-02-14
          ...
4747   2018-02-01
4748   2018-02-02
4749   2018-02-05
4750   2018-02-06
4751   2018-02-07
Name: date, Length: 4752, dtype: datetime64[ns]

In [38]:
tech_list =all_data['Name'].unique()
tech_list

array(['AAPL', 'AMZN', 'GOOG', 'MSFT'], dtype=object)